app/Controllers/HomeUser.php

    public function index()
    {
        // Data statistik untuk dashboard
        $stats = [
            'users' => 1200,
            'transactions' => 340,
            'products' => 150,
            'pending_orders' => 25,
        ];

        // Mengambil data produk dari database
        $productModel = new ProductModel();
        $products = $productModel->findAll(); // Mendapatkan semua produk
---
SELECT *
FROM `products`