app/Controllers/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $data['products'] = $this->productModel->findAll();