app/Controllers/ProfileController.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function index()
    {
        // Ambil data profil berdasarkan session
        $userModel = new UserModel();
        $user = $userModel->where('email', session()->get('email'))->first();